package data

// const PutPublicPage = "📝 *Отправьте текст заявки боту в следующем формате:*\n\n1\\.\\ Продажа/Покупка \\(Выбрать одно из двух\\)\n2\\.\\ Профиль/Канал \\(Выбрать одно из двух\\)\n3\\.\\ Ссылка \n4\\.\\ Краткое описание и пожелания \n5\\.\\ Цена и условия"

// // buttons

// const BackBtn = "← Назад"
// const PaidBtn = "☑️ Оплачено"
// const DeclinePaidBtn = "❌ Отклонить"
// const ChoosePublicPageBtn = "👥 Выбрать сообщество"
// const CreateRequestBtn = "📝 Создать запрос"
// const ApprovePublicPageBtn = "☑️ Одобрить"
// const DeclinePublicPageBtn = "❌ Отклонить"

// // response

// const AfterSubmittingPublicPage = "☑️ *Ваша заявка отправлена на модерацию*"
// const RejectPublicPage = "❌ *К сожалению, ваша заявка не прошла модерацию*\\.\\ Попробуйте внести правки и отправить заявку снова \n\nС уважением,\nБиржа рекламы Ton\\.\\Place"

// const AfterPaymentResponse = "💎 *Благодим вас за использование сервиса*\\.\\ В течение 2\\-\\5 минут статус заявки обновится"
// const FailedPaymentResponse = "❌ *К сожалению оплата с вашей стороны не поступила и заявка была удалена*\\.\\ Попробуйте отправить заявку снова\n\nС уважением,\nБиржа рекламы Ton\\.\\Place"
// const SuccessPaymentResponse = "☑️ *Ваша заявка была одобрена и опубликована* \n\nС уважением,\nБиржа рекламы Ton\\.\\Place"

// // payment details

// const Wallet = "EQBtZgocpA8H1S3U1uCj-Uoz1BvuDESm2laaNVEexQZ7nQPp"
// const Fee = 0.5
// const PaymentMessage = "Для публикации заявки необходимо добавить комментарий к платежу, который указан ниже, перевести %s💎, и после успешного перевода денег нажать кнопку %s\n\n*Кошелек*:  `\\%s`\\ \n*Комментарий к платежу*: `\\%s`\\ \n"

// //ton center

// const ApiKey = "498f0c3860ee799bb60650d5a7c0adfa2cf5adc877dc430cdd1adef1bf402888"

// //channel

// const AdExchangeChannel = -1001523233085
// const AdminChannel = -1001688233561